{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report describing an update to landingImages.ts to use GitHub raw URLs.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to their short descriptions.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Renders the LandingPage component as the root app.",
  "frontend/src/components/cta/BuyNowButton.tsx": "Gradient-styled CTA button redirecting users to the affiliate URL.",
  "frontend/src/components/landing/sections/BenefitsSection.tsx": "Benefits grid with icons plus two supporting images each followed by a Buy Now button.",
  "frontend/src/components/landing/sections/FAQSection.tsx": "Accordion-based FAQ section driven by structured copy.",
  "frontend/src/components/landing/sections/FooterSection.tsx": "Footer with modal dialogs for Privacy Policy and Terms & Conditions and basic copyright info.",
  "frontend/src/components/landing/sections/HeroSection.tsx": "Hero section with trust badges, headline, product image, two CTA buttons, and star rating.",
  "frontend/src/components/landing/sections/HowItWorksSection.tsx": "Three-step explanation of how the product works with numbered icons.",
  "frontend/src/components/landing/sections/IngredientsSection.tsx": "Ingredients section with product image, Buy Now button, and feature cards with icons.",
  "frontend/src/components/landing/sections/ProblemSection.tsx": "Problem description section with three issue cards using alert-style icons.",
  "frontend/src/components/landing/sections/SolutionSection.tsx": "Displays the solution section with headline, product image, buy button, and a list of benefits using solutionCopy.",
  "frontend/src/components/landing/sections/StrongCTASection.tsx": "Renders a strong call‑to‑action block with product image, urgency message, and multiple Buy Now buttons.",
  "frontend/src/components/landing/sections/TestimonialsSection.tsx": "Shows a testimonials grid with ratings, quotes, author info, and a supporting image with a buy button.",
  "frontend/src/components/landing/sections/TrustSafetySection.tsx": "Displays trust and safety features with icons plus product trust badges.",
  "frontend/src/constants/affiliate.ts": "Defines the affiliate purchase URL and CTA button label.",
  "frontend/src/constants/landingImages.ts": "Exports centralized URLs for all landing page images.",
  "frontend/src/content/provadentCopy.ts": "Contains all static marketing copy for the landing page including hero, problem, solution, benefits, steps, and ingredients text blocks.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity with login, logout, identity loading, and status handling.",
  "frontend/src/index.css": "Configures Tailwind layers and CSS variables for theming, including light/dark mode and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/LandingPage.tsx": "Renders the full landing page by composing all section components in order within a styled container.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, and extended theme options using plugins.",
  "project_state.json": "Stores the project’s current build state, requirements, constraints, issues, and image-related architectural notes."
}